tutorials/ibmAirfoil_IBMSimpleFoam_withoutPhiHbyAMasking/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../system/globalVariables";

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $gV_UInlet;

boundaryField
{
    inlet
    {
        type            freestreamVelocity;
        freestreamValue uniform $gV_UInlet;
    }
    outlet
    {
        type            freestreamVelocity;
        freestreamValue uniform $gV_UInlet;
    }
    top
    {
        type            freestreamVelocity;
        freestreamValue uniform $gV_UInlet;
    }
    bottom
    {
        type            freestreamVelocity;
        freestreamValue uniform $gV_UInlet;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
