tutorials/ibmAirfoil_IBMSimpleFoam_withoutPhiHbyAMasking/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    div(phi,U)      Gauss linearUpwind grad(U);

    div((nuEff*dev2(T(grad(U)))))   Gauss linear;
    div(diffusivity,U)              Gauss linear;
}

laplacianSchemes
{
    default                                             Gauss linear corrected;

    //laplacian(rAUf,p)                                   Gauss linear corrected;
    //laplacian(rAUf,pcorr)                               Gauss linear corrected;
    laplacian(IBM,U)                                    IBMGauss linear orthogonal; //IBM
    //laplacian(hydrogenDiffusionDiffusivity,hydrogen)    Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
